src/test/resources/betamax/tapes/create_a_payment.yaml

!tape
name: create a payment
interactions:
- recorded: 2015-04-14T09:34:09.489Z
  request:
    method: POST
    uri: https://api-sandbox.gocardless.com/payments
    headers:
      Accept-Encoding: gzip
      Connection: Keep-Alive
      Content-Length: '107'
      Content-Type: application/json; charset=utf-8
      GoCardless-Version: '2014-11-03'
      Host: api-sandbox.gocardless.com
      User-Agent: gocardless-pro-client/0.0.1-SNAPSHOT Mac_OS_X/10.10.2 Java_HotSpot(TM)_64-Bit_Server_VM/1.8.0_40
    body: '{"payments":{"amount":2000,"currency":"GBP","links":{"mandate":"MD00001PEYCSQF"},"metadata":{"foo":"bar"}}}'
  response:
    status: 201
    headers:
      Cache-Control: no-store
      Content-Type: application/json; charset=utf-8
      Date: Tue, 14 Apr 2015 09:34:09 GMT
      ETag: W/"face88665354ca14c9b984971676c9e2"
      Location: https://api-sandbox.gocardless.com/payments/PM00008KWW97PE
      Pragma: no-cache
      RateLimit-Limit: '2000'
      RateLimit-Remaining: '1999'
      RateLimit-Reset: Tue, 14 Apr 2015 09:35:00 GMT
      Server: nginx
      Status: 201 Created
      Strict-Transport-Security: max-age=31556926; includeSubDomains
      X-Content-Type-Options: nosniff
      X-Frame-Options: SAMEORIGIN
      X-Request-Id: 15d526d6-4d8d-41e1-8fac-d8be22b63ebc
      X-XSS-Protection: 1; mode=block
    body: '{"payments":{"id":"PM00008KWW97PE","created_at":"2015-04-14T09:34:09.141Z","charge_date":"2015-04-17","amount":2000,"description":null,"currency":"GBP","status":"pending_submission","amount_refunded":0,"reference":null,"metadata":{"foo":"bar"},"links":{"mandate":"MD00001PEYCSQF","creditor":"CR000035EME9H5"}}}'
